| Τύπος Καλωδίου | Θωράκιση     | Αντοχή σε Παρεμβολές | Κόστος | Ευκαμψία | Χρήση                      |
| -------------- | ------------ | -------------------- | ------ | -------- | -------------------------- |
| UTP            | Καμία        | Χαμηλή               | Χαμηλό | Υψηλή    | Οικιακά/γραφεία, LAN       |
| STP            | Πλήρης       | Υψηλή                | Υψηλό  | Μέτρια   | Βιομηχανικές εγκαταστάσεις |
| FTP            | Κοινή (foil) | Μέτρια               | Μέτριο | Μέτρια   | Επαγγελματικοί χώροι       |
