| Χαρακτηριστικό        | Μεταγωγή Μηνύματος             | Μεταγωγή Πακέτων              |
| --------------------- | ------------------------------ | ----------------------------- |
| Μονάδα μετάδοσης      | Ολόκληρο μήνυμα                | Μικρά πακέτα                  |
| Αποθήκευση σε κόμβους | Ολόκληρο μήνυμα                | Μόνο κάθε πακέτο              |
| Ταχύτητα              | Αργή                           | Γρήγορη                       |
| Αντοχή σε βλάβες      | Μικρή                          | Μεγάλη (δυναμική δρομολόγηση) |
| Απαιτήσεις σε μνήμη   | Υψηλές (ολόκληρο μήνυμα)       | Μικρές                        |
| Χρήση σήμερα          | Πολύ περιορισμένη / παρωχημένη | Πολύ διαδεδομένη (Internet)   |
