Ομοιότητες:
1. Όλα τα είδη επικοινωνίας αφορούν τη μεταφορά δεδομένων μεταξύ δύο ή περισσότερων συσκευών.

2. Χρησιμοποιούν μέσα μετάδοσης (όπως καλώδια, ραδιοκύματα κ.λπ.).

3. Είναι θεμελιώδη μοντέλα επικοινωνίας σε δίκτυα υπολογιστών και τηλεπικοινωνίες.

Διαφορές:
1. Είδος	        Κατεύθυνση Επικοινωνίας	      Δυνατότητα ταυτόχρονης αποστολής/λήψης
2. Simplex	     Μόνο προς μία κατεύθυνση	      Όχι
3. Half Duplex	  Και προς τις δύο, εναλλάξ	   Όχι
4. Full Duplex	  Και προς τις δύο, ταυτόχρονα	Ναι
