 Τι είναι η τεχνική Frame Relay:

Η Frame Relay είναι μια τεχνική μεταγωγής πακέτων που χρησιμοποιείται για τη μετάδοση δεδομένων υψηλής 
ταχύτητας σε ευρείας περιοχής δίκτυα (WAN - Wide Area Networks). Χρησιμοποιεί εικονικά κυκλώματα (virtual circuits) 
και βασίζεται στην τεχνολογία μεταγωγής πλαισίων (frames), 
εξ ου και το όνομά της.
Αναπτύχθηκε ως πιο απλοποιημένη και οικονομική εναλλακτική λύση της X.25, προσφέροντας χαμηλότερες 
καθυστερήσεις και υψηλότερες ταχύτητες.


 Ποιες ανάγκες καλύπτει:

- Διασύνδεση τοπικών δικτύων (LANs) σε απομακρυσμένες τοποθεσίες μέσω ενός WAN.
- Μετάδοση φωνής, εικόνας και δεδομένων με οικονομικό τρόπο.
- Υποστήριξη εφαρμογών πολυμέσων και πολυσύνθετων δικτύων, χωρίς την ανάγκη για συνεχή κατανομή πόρων.
- Βελτιστοποίηση κόστους για επιχειρήσεις που χρειάζονται ευέλικτη και γρήγορη επικοινωνία σε πολλές τοποθεσίες.



 
